In [2]:
import pandas as pd
import numpy as np

In [72]:
pd.options.display.float_format = '{:,.2f}'.format

### Problema 1
Vamos praticar gerar matrizes e fazer operações com as linhas e colunas:

(a) Crie uma matriz A com as dimensões (5, 4) e elementos aleatórios variando entre 0 e 50, com o 50 incluso;

__Dica:__ Utilize as funções `np.random.randint` e `np.reshape`

(b) Retorne a média do vetor

(c) Retorne os menores valores de cada coluna;

(d) Retorne os maiores valores de cada linha.

In [4]:
matriz_a = np.random.randint(0, 51, 20).reshape(5, 4)
matriz_a

array([[31, 17, 17, 13],
       [ 7,  6, 26, 39],
       [44, 40, 49, 27],
       [40, 15, 10,  9],
       [24, 41,  6, 33]])

In [5]:
matriz_a.mean()

24.7

In [8]:
np.min(matriz_a, axis = 0)

array([7, 6, 6, 9])

In [9]:
matriz_a.max(axis = 1)

array([31, 39, 49, 40, 41])

### Problema 2

Crie um objeto DataFrame que contenha os dados da tabela abaixo, os quais se referem ao peso, altura e idade de cinco pessoas:


| Peso (kg) | Altura (cm) | Idade (anos) |
|-----------|-------------|--------------|
|  47 | 161	| 31 |
|  80 | 170	| 21 |
|  60 | 175	| 16 |
|  90 | 162	| 28 |
| 100 | 185	| 23 |
| 147 | 189 | 32 |

Com base no DataFrame criado, realize o que for pedido nos itens abaixo:

(a) Visualize apenas os dados da coluna que contém a altura das pessoas;

(b) Obtenha a idade média das pessoas;

(c) Obtenha os dados das pessoas que estão abaixo da altura média;

(d) Crie um nova coluna no DataFrame que contenha o IMC (Índice de Massa Corporal) de cada pessoa;

__Obs.:__ A fórmula para o IMC é dada por IMC = Peso/(Altura)² com o peso em kg e a altura em metros.

(e) Remova a coluna que contém a idade das pessoas;

(f) Crie uma nova coluna chamada Classificação, que contenha a classificação de cada indivíduo, de acordo com o seu IMC. Para isso, consulte a tabela abaixo.

| IMC             | Classificação |
|-----------------|---------------|
Menor que 18,5    | Subpeso |
Entre 18,5 e 24,9 | Normal |
Entre 25,0 e 29,9 | Sobrepeso |
Entre 30,0 e 39,9 | Obesidade Grau I |
Maior que 40,0    | Obesidade Grau II |

(g) Salve esses dados do DataFrame em um arquivo csv.

In [13]:
tabela = pd.read_csv('./data/imc.csv', sep = ',')
tabela

   Unnamed: 0  Peso  Altura   IMC      Classificação
0           0    47     161  18.1            Subpeso
1           1    80     170  27.7          Sobrepeso
2           2    60     175  19.6             Normal
3           3    90     162  34.3   Obesidade Grau I
4           4   100     185  29.2          Sobrepeso
5           5   147     189  41.2  Obesidade Grau II

In [18]:
dados = {"Altura(cm)":[161,170,175,162,185,189]}
df = pd.DataFrame(dados)
df.mean()

Altura(cm)    173.666667
dtype: float64

In [19]:
df[['Altura(cm)']]

   Altura(cm)
0         161
1         170
2         175
3         162
4         185
5         189

In [ ]:
df['Idade(anos)'].mean()

In [21]:
df['peso(kg)'].astype(float)
df['Altura(cm)'].astype(float)
df['IMC'] = ((df['peso(kg)']))/(df['Altura(cm)'])/100)*df['Altura(cm)'])
df

SyntaxError: unmatched ')' (Temp/ipykernel_7936/925901259.py, line 2)

In [22]:
df.drop(['Idade(anos)'], axis = 0, inplace = True)
df

KeyError: "['Idade(anos)'] not found in axis"

In [ ]:
classificacao = array['Subpeso', 'Normal', 'Sobrepeso', 'Obesidade Grau I', 'Obesidade Grau II']
df[df['IMC']<18.5

In [ ]:
df['Classificacao'] = np.where(df['IMC']<=18.5,'Subpeso'|| df['IMC']>=18.5 && DF['IMC']<25, 'Normal', 'Sobrepeso'

### Problema 3

O arquivo avocado.xlsx consiste em um dataset que contém dados sobre vendas de abacates  em diversas regiões dos Estados Unidos. Essa dataset contém as seguintes colunas:

| Coluna | Descrição |
|--------|-----------|
| Date | data da observação |
| AveragePrice | preço médio de um único abacate |
| year | ano |
| region | cidade ou região da observação |
| Total Volume | volume total de abacates vendidos |

Além das informações acima, contidas no arquivo avocado.xlsx, o tipo do abacate (convencional ou orgânico) também seria uma informação importante para a sua análise. Suponhamos que você conseguiu essas informações para cada uma das observações do arquivo avocado.csv, na mesma ordem, e salvou-as no arquivo avocado_type.xlsx. Portanto, tudo o que você precisa é juntar esses dois arquivos em um mesmo DataFrame.

Com o DataFrame criado, obtenha o que é solicitado nos itens elencados abaixo:

In [28]:
df_avocado = pd.read_csv('./data/avocado.csv', sep = ';')
df_avocado_type = pd.read_excel('./data/avocado_type.xlsx')
df_avocado

             Date  AveragePrice  Total Volume  year            region
0      2015-12-27          1.33      64236.62  2015            Albany
1      2015-12-20          1.35      54876.98  2015            Albany
2      2015-12-13          0.93     118220.22  2015            Albany
3      2015-12-06          1.08      78992.15  2015            Albany
4      2015-11-29          1.28      51039.60  2015            Albany
...           ...           ...           ...   ...               ...
18244  2018-02-04          1.63      17074.83  2018  WestTexNewMexico
18245  2018-01-28          1.71      13888.04  2018  WestTexNewMexico
18246  2018-01-21          1.87      13766.76  2018  WestTexNewMexico
18247  2018-01-14          1.93      16205.22  2018  WestTexNewMexico
18248  2018-01-07          1.62      17489.58  2018  WestTexNewMexico

[18249 rows x 5 columns]

(a) A quantidade de abacates do tipo convecional e do tipo orgânico.

In [27]:
df_avocado_type.type.value_counts()

orgânico        9135
convencional    9114
Name: type, dtype: int64


(b) A quantidade de registros (linhas) de abacates vendidos para cada região ordenada da maior venda para a menor.

(c) Para que todos os labels das colunas fiquem padronizados, renomeie aqueles que estão iniciando em letra minúscula para que iniciem em letra maiúscula, trocando espaço por _ e adicionando _ como separação de texto.

In [31]:
df_copy = df_avocado.copy()
troca_nomes = {'AveragePrice':'Average_Price', 'Total Volume':'Total_Volume', 'year':'Year', 'region':'Region'}
df_copy.rename(troca_nomes, axis = 1, inplace = True)
df_copy.head()

         Date  Average_Price  Total_Volume  Year  Region
0  2015-12-27           1.33      64236.62  2015  Albany
1  2015-12-20           1.35      54876.98  2015  Albany
2  2015-12-13           0.93     118220.22  2015  Albany
3  2015-12-06           1.08      78992.15  2015  Albany
4  2015-11-29           1.28      51039.60  2015  Albany

(d) Essa dado possui duplicados? Se sim, remova-os do dataset.

In [32]:
df_copy = df_copy.drop_duplicates()
df_copy

             Date  Average_Price  Total_Volume  Year            Region
0      2015-12-27           1.33      64236.62  2015            Albany
1      2015-12-20           1.35      54876.98  2015            Albany
2      2015-12-13           0.93     118220.22  2015            Albany
3      2015-12-06           1.08      78992.15  2015            Albany
4      2015-11-29           1.28      51039.60  2015            Albany
...           ...            ...           ...   ...               ...
18244  2018-02-04           1.63      17074.83  2018  WestTexNewMexico
18245  2018-01-28           1.71      13888.04  2018  WestTexNewMexico
18246  2018-01-21           1.87      13766.76  2018  WestTexNewMexico
18247  2018-01-14           1.93      16205.22  2018  WestTexNewMexico
18248  2018-01-07           1.62      17489.58  2018  WestTexNewMexico

[18249 rows x 5 columns]

(e) Retire dos dados a região 'TotalUS'

In [34]:
df_copy.drop(df_copy[df_copy['Region']=='TotalUS'].index, inplace = True)
df_copy

             Date  Average_Price  Total_Volume  Year            Region
0      2015-12-27           1.33      64236.62  2015            Albany
1      2015-12-20           1.35      54876.98  2015            Albany
2      2015-12-13           0.93     118220.22  2015            Albany
3      2015-12-06           1.08      78992.15  2015            Albany
4      2015-11-29           1.28      51039.60  2015            Albany
...           ...            ...           ...   ...               ...
18244  2018-02-04           1.63      17074.83  2018  WestTexNewMexico
18245  2018-01-28           1.71      13888.04  2018  WestTexNewMexico
18246  2018-01-21           1.87      13766.76  2018  WestTexNewMexico
18247  2018-01-14           1.93      16205.22  2018  WestTexNewMexico
18248  2018-01-07           1.62      17489.58  2018  WestTexNewMexico

[17911 rows x 5 columns]

(g) Apresente as regiões que mais venderam abacate em todo o período em ordem decrescente.

In [37]:
df_copy.groupby(['Region']).Total_Volume.sum().sort_values(ascending=False)

Region
West                   1.086779e+09
California             1.028982e+09
SouthCentral           1.011280e+09
Northeast              7.132809e+08
Southeast              6.152384e+08
GreatLakes             5.896425e+08
Midsouth               5.083494e+08
LosAngeles             5.078965e+08
Plains                 3.111885e+08
NewYork                2.407341e+08
DallasFtWorth          2.084193e+08
Houston                2.031679e+08
PhoenixTucson          1.956433e+08
WestTexNewMexico       1.445218e+08
Denver                 1.389025e+08
SanFrancisco           1.358302e+08
BaltimoreWashington    1.347139e+08
Chicago                1.337023e+08
Portland               1.105522e+08
Seattle                1.092142e+08
MiamiFtLauderdale      9.767322e+07
Boston                 9.727398e+07
SanDiego               8.979192e+07
Atlanta                8.860512e+07
Sacramento             7.516375e+07
Philadelphia           7.183880e+07
NorthernNewEngland     7.153289e+07
Tampa                  6.600454e+07
Detroit                6.342242e+07
SouthCarolina          6.075377e+07
Orlando                5.866070e+07
LasVegas               5.437691e+07
HartfordSpringfield    5.067054e+07
RaleighGreensboro      4.820273e+07
NewOrleansMobile       4.569514e+07
CincinnatiDayton       4.452201e+07
RichmondNorfolk        4.223085e+07
HarrisburgScranton     4.180886e+07
Nashville              3.561209e+07
Charlotte              3.555554e+07
StLouis                3.207283e+07
Indianapolis           3.026339e+07
GrandRapids            3.021174e+07
Columbus               2.999336e+07
Jacksonville           2.879000e+07
Roanoke                2.504201e+07
BuffaloRochester       2.296247e+07
Pittsburgh             1.880635e+07
Louisville             1.609700e+07
Albany                 1.606780e+07
Spokane                1.556528e+07
Boise                  1.441319e+07
Syracuse               1.094267e+07
Name: Total_Volume, dtype: float64

(h) Calcule o volume total de abacates vendidos para cada tipo e ano.

(f) existe alguma região que foi a maior responsável pela queda na produção de 2018?

(g) Qual cidade menos faturou com a venda de abacates?

### Problema 4

Com base no dataset 'Video_Games_Sales.csv' responda:


(a) Quantos jogos existem em cada genero?

In [38]:
games = pd.read_csv('./data/Video_Games_Sales.csv', sep = ';')
games

,Name,Platform,Year_of_Release,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales,Critic_Score,Critic_Count,User_Score,User_Count,Developer,Rating
0,Wii Sports,Wii,2006.0,Sports,Nintendo,41.36,28.96,3.77,8.45,82.53,76.0,51.0,8.0,322.0,Nintendo,E
1,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24,NaN,NaN,NaN,NaN,NaN,NaN
2,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.68,12.76,3.79,3.29,35.52,82.0,73.0,8.3,709.0,Nintendo,E
3,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.61,10.93,3.28,2.95,32.77,80.0,73.0,8.0,192.0,Nintendo,E
4,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
16714,Samurai Warriors: Sanada Maru,PS3,2016.0,Action,Tecmo Koei,0.00,0.00,0.01,0.00,0.01,NaN,NaN,NaN,NaN,NaN,NaN
16715,LMA Manager 2007,X360,2006.0,Sports,Codemasters,0.00,0.01,0.00,0.00,0.01,NaN,NaN,NaN,NaN,NaN,NaN
16716,Haitaka no Psychedelica,PSV,2016.0,Adventure,Idea Factory,0.00,0.00,0.01,0.00,0.01,NaN,NaN,NaN,NaN,NaN,NaN
16717,Spirits & Spells,GBA,2003.0,Platform,Wanadoo,0.01,0.00,0.00,0.00,0.01,NaN,NaN,NaN,NaN,NaN,NaN
16718,Winning Post 8 2016,PSV,2016.0,Simulation,Tecmo Koei,0.00,0.00,0.01,0.00,0.01,NaN,NaN,NaN,NaN,NaN,NaN

In [39]:
games.groupby(['Genre'])['Name'].count()

Genre
Action          3370
Adventure       1303
Fighting         849
Misc            1750
Platform         888
Puzzle           580
Racing          1249
Role-Playing    1500
Shooter         1323
Simulation       874
Sports          2348
Strategy         683
Name: Name, dtype: int64

(b) Temos duplicados nesses dados? E nulos?

In [40]:
games.isna().sum()

Name                  2
Platform              0
Year_of_Release     269
Genre                 2
Publisher            54
NA_Sales              0
EU_Sales              0
JP_Sales              0
Other_Sales           0
Global_Sales          0
Critic_Score       8582
Critic_Count       8582
User_Score         9129
User_Count         9129
Developer          6623
Rating             6769
dtype: int64

(b) Quantos jogos de cada publisher receberam nota acima de 9 na avaliação dos usuarios?

In [ ]:
games.groupby(['Publisher'])['User_Score']


(c) Faça uma tabela que mostre o total vendido por ano por pais/globalmente de cada publisher? Você consegue observar algum padrão? Com se comportaram as vendas na América do Norte (NA) ao longo do tempo? O mesmo foi visto nos demais lugares?


(d) Qual foi jogo mais vendido na união européia? De que ano ele é e qual a editora?


(e) Quantos % os generos ['Racing', 'Sports', 'Shooter'] representam na base de dados?

(f) Qual plataforma vendeu menos globalmente? obs: imprimir somente o nome

### Problema 5
A pasta 'data/datasus' contém informações sobre casos de dengue e tabelas auxiliares. <br>

| Tabela | Conteúdo |
|--------|----------|
| Dengue | Quantidade de casos por município |
| Agua | Quantidade de residências em cada município por tipo o abastecimento de água |
| InstalacoesSanitarias | Quantidade de residências em cada município por tipo de rede de esgoto |
| Pib | PIB per capita de cada município |
| Municipios | Relaciona o id_municipio com seu nome e estado |
| Populacao | Quantidade de pessoas morando em áreas urbanas, rurais e população total por município |
| Sexo | Quantidade de pessoas por sexo em cada município |

(a) Calcular o número de casos de dengue por cada estado apresentando os dados em ordem decrescente.

(b) Utilizando o dataset InstalacoesSanitarias.csv, determine o número de pessoas que não possuem meio sanitário algum de descarte de dejetos por estado.

(c) Crie uma coluna com a posição de ranking considerando o PIB. Os maiores PIB devem ter os menores valores de ranking.

(d) Qual o PIB dos 5 municípios com mais casos de dengue e sua posição no ranking?